Es el momento de ponernos a trabajar con los valores nulos üí™üèΩ. A lo largo de este ejercicio de pair programming vamos a intentar eliminar los valores nulos de nuestras columnas. En la lecci√≥n hemos aprendido varios m√©todos, nosotras os planteamos los ejercicios pero sentiros libres de usar el m√©todo que m√°s se adapte a vuestras necesidades. Manos a la obra!

    1. Lo primero que tenemos que evaluar es en que columnas tenemos nulos y que cantidad tenemos en cada una. ¬øHay alguna columna con una gran cantidad de nulos? En caso de que sea as√≠ deberemos eliminarla.

In [1]:
import pandas as pd
import seaborn as sns
import numpy as np
import matplotlib.pyplot as plt
import sidetable

pd.options.display.max_columns = None

In [2]:
df = pd.read_csv('datos/bank_additional_edit3.csv', index_col = 0)

Hemos decidido que el 20% no nos parece suficiente para borrar nuestra columna, por lo tanto, hemos creado una copia de los datos, donde si hemos borrado la columna de default simplemente para practicar pero conservando los datos originales.

In [3]:
df.stb.missing()

                missing  total    percent
default            8600  41180  20.883924
education          1734  41180   4.210782
housing             994  41180   2.413793
loan                994  41180   2.413793
job                 334  41180   0.811073
marital              84  41180   0.203983
index                 4  41180   0.009713
cons,price,idx        4  41180   0.009713
month                 4  41180   0.009713
month_day_week        4  41180   0.009713
y                     4  41180   0.009713
nr,employed           4  41180   0.009713
euribor3m             4  41180   0.009713
cons,conf,idx         4  41180   0.009713
day_week              4  41180   0.009713
emp,var,rate          4  41180   0.009713
poutcome              4  41180   0.009713
campaign              4  41180   0.009713
duration              4  41180   0.009713
contact               4  41180   0.009713
age                   2  41180   0.004857
pdays                 2  41180   0.004857
previous              1  41180   0.002428

In [4]:
df.shape

(41180, 23)

In [5]:
df_borrar = df.copy()

In [10]:
df_borrar.head()

,index,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week,month,day_week
0,0.0,56.0,housemaid,married,basic 4y,No,No,No,telephone,261.0,1.0,999.0,0.0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']",'may','mon'
2,2.0,37.0,services,married,high school,No,Si,No,telephone,226.0,1.0,999.0,0.0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']",'may','mon'
3,3.0,40.0,administrative,married,basic 6y,No,No,No,telephone,151.0,1.0,999.0,0.0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']",'may','mon'
4,4.0,56.0,services,married,high school,No,No,Si,telephone,307.0,1.0,999.0,0.0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']",'may','mon'
6,6.0,59.0,administrative,married,professional course,No,No,No,telephone,139.0,1.0,999.0,0.0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']",'may','mon'

In [12]:
df_borrar.dropna(subset= ["default"], how = "any", inplace = True)
df_borrar.head()
df_borrar.shape

(32580, 23)

In [13]:
df_borrar.isnull().sum()

index                0
age                  0
job                178
marital             69
education         1182
default              0
housing            763
loan               763
contact              0
duration             0
campaign             0
pdays                0
previous             0
poutcome             0
emp,var,rate         0
cons,price,idx       0
cons,conf,idx        0
euribor3m            0
nr,employed          0
y                    0
month_day_week       0
month                0
day_week             0
dtype: int64

In [9]:
nulos = pd.DataFrame((df.isnull().sum() * 100) / df.shape[0]).reset_index()
nulos.columns = ["columna", "porcentaje"]
nulos

           columna  porcentaje
0            index    0.009713
1              age    0.004857
2              job    0.811073
3          marital    0.203983
4        education    4.210782
5          default   20.883924
6          housing    2.413793
7             loan    2.413793
8          contact    0.009713
9         duration    0.009713
10        campaign    0.009713
11           pdays    0.004857
12        previous    0.002428
13        poutcome    0.009713
14    emp,var,rate    0.009713
15  cons,price,idx    0.009713
16   cons,conf,idx    0.009713
17       euribor3m    0.009713
18     nr,employed    0.009713
19               y    0.009713
20  month_day_week    0.009713
21           month    0.009713
22        day_week    0.009713

    2. Es el momento de eliminar los nulos:
        2.1. Reemplazad los valores nulos de la columna age por la media de la edad, redondeada a dos decimales.

In [18]:
df["age"].replace(np.nan, round(df["age"].mean(), 2), inplace = True)
df["age"].unique()

array([56.  , 57.  , 37.  , 40.  , 45.  , 59.  , 41.  , 24.  , 25.  ,
       29.  , 35.  , 54.  , 46.  , 50.  , 39.  , 30.  , 55.  , 49.  ,
       34.  , 52.  , 58.  , 32.  , 38.  , 44.  , 42.  , 60.  , 53.  ,
       47.  , 51.  , 48.  , 33.  , 31.  , 43.  , 36.  , 28.  , 27.  ,
       26.  , 22.  , 23.  , 20.  , 21.  , 61.  , 19.  , 18.  , 70.  ,
       66.  , 76.  , 67.  , 73.  , 88.  , 77.  , 68.  , 75.  , 63.  ,
       80.  , 65.  , 72.  , 82.  , 64.  , 71.  , 69.  , 78.  , 85.  ,
       62.  , 79.  , 83.  , 81.  , 74.  , 17.  , 87.  , 91.  , 98.  ,
       86.  , 84.  , 92.  , 89.  , 39.94])

        2.2. Reemplazad los valores nulos de la columna duration por la mediana de la edad, redondeada a dos decimales.

In [20]:
df["duration"].replace(np.nan, round(df["age"].mean(), 2), inplace = True)
df["duration"].unique()

array([ 261.  ,  149.  ,  226.  , ..., 1556.  , 1868.  ,   39.94])

        2.3. En relaci√≥n a las columnas de education, default, housing y loan al tratarse de columnas de tipo categ√≥rica, reemplazad los valores nulos por una nueva categ√≥ria que se llame unknown.

In [21]:
lista_columnas = ["education", "default", "loan", "housing"]

for columna in lista_columnas:
    df[columna].replace(np.nan, "unknown", inplace = True)

In [23]:
df.head(10)

,index,age,job,marital,education,default,housing,loan,contact,duration,campaign,pdays,previous,poutcome,"emp,var,rate","cons,price,idx","cons,conf,idx",euribor3m,"nr,employed",y,month_day_week,month,day_week
0,0.0,56.0,housemaid,married,basic 4y,No,No,No,telephone,261.0,1.0,999.0,0.0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']",'may','mon'
1,1.0,57.0,services,married,high school,unknown,No,No,telephone,149.0,1.0,999.0,0.0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']",'may','mon'
2,2.0,37.0,services,married,high school,No,Si,No,telephone,226.0,1.0,999.0,0.0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']",'may','mon'
3,3.0,40.0,administrative,married,basic 6y,No,No,No,telephone,151.0,1.0,999.0,0.0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']",'may','mon'
4,4.0,56.0,services,married,high school,No,No,Si,telephone,307.0,1.0,999.0,0.0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']",'may','mon'
5,5.0,45.0,services,married,basic 9y,unknown,No,No,telephone,198.0,1.0,999.0,0.0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']",'may','mon'
6,6.0,59.0,administrative,married,professional course,No,No,No,telephone,139.0,1.0,999.0,0.0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']",'may','mon'
7,7.0,41.0,blue-collar,married,unknown,unknown,No,No,telephone,217.0,1.0,999.0,0.0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']",'may','mon'
8,8.0,24.0,technician,single,professional course,No,Si,No,telephone,380.0,1.0,999.0,0.0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']",'may','mon'
9,9.0,25.0,services,single,high school,No,Si,No,telephone,50.0,1.0,999.0,0.0,nonexistent,1.1,93.994,-36.4,4.857,5191.0,no,"['may', 'mon']",'may','mon'

In [24]:
df["loan"].unique()

array(['No', 'Si', 'unknown'], dtype=object)

In [25]:
df["housing"].unique()

array(['No', 'Si', 'unknown'], dtype=object)

        2.4. Reemplazad los valores nulos de las columna job y marital por el valor m√°s frecuente (la moda).

In [28]:
lista_col = ["job", "marital"]

for columna in lista_col:
    df[columna].replace(np.nan, df[columna].mode()[0], inplace = True)

In [31]:
df["job"].mode()

0    administrative
Name: job, dtype: object

In [32]:
df["job"].value_counts()

administrative    10753
blue-collar        9253
technician         6739
services           3967
management         2924
retired            1718
entrepreneur       1456
self-employed      1421
housemaid          1060
unemployed         1014
student             875
Name: job, dtype: int64

In [34]:
df.isna().sum()

index             4
age               0
job               0
marital           0
education         0
default           0
housing           0
loan              0
contact           4
duration          0
campaign          4
pdays             2
previous          1
poutcome          4
emp,var,rate      4
cons,price,idx    4
cons,conf,idx     4
euribor3m         4
nr,employed       4
y                 4
month_day_week    4
month             4
day_week          4
dtype: int64

    3. Guardad el csv.

In [35]:
df.to_csv("datos/bank_additional_edit4.csv")